## [DataFrame 연산-2]
- 일대일 대응으로 인덱스가 동일한 원소들 끼리 연산 수행
- Dataframe과 DataFrame 연산 수행

In [29]:
import pandas as pd

In [30]:
data={'A':[98,78,100,52],
      'B':[96,58,10,42]}

In [31]:
# 3. Dict 데이터 --> DataFrame으로 저장
df1=pd.DataFrame(data)
df2=df1/4

In [32]:
print(df1, df2, sep='\n\n')

     A   B
0   98  96
1   78  58
2  100  10
3   52  42

      A     B
0  24.5  24.0
1  19.5  14.5
2  25.0   2.5
3  13.0  10.5

In [33]:
# 3. 연산수행해보기
# 산술 연산
df1 * df2

        A       B
0  2401.0  2304.0
1  1521.0   841.0
2  2500.0    25.0
3   676.0   441.0

In [34]:
# 4. 비교연산수행
df1 <= df2

       A      B
0  False  False
1  False  False
2  False  False
3  False  False

In [35]:
df1 >= df2

      A     B
0  True  True
1  True  True
2  True  True
3  True  True

In [36]:
# 5. 연산수행 -> DataFrame 과 Series
# 산술연산
# 'A' 컬럼만 추출
sr1=df1.A
sr1.index # ㅋ컬럼없음

RangeIndex(start=0, stop=4, step=1)

In [37]:
df2.index # 컬럼있음.

RangeIndex(start=0, stop=4, step=1)

In [38]:
sr1+df2 # 이렇게 하면 안맞아 들어감.

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [41]:
# Series를 DataFrame으로 변환 방법1
srdf=sr1.to_frame()
srdf

     A
0   98
1   78
2  100
3   52

In [42]:
df1+srdf

     A   B
0  196 NaN
1  156 NaN
2  200 NaN
3  104 NaN

In [43]:
df1.add(srdf, fill_value=0)

     A     B
0  196  96.0
1  156  58.0
2  200  10.0
3  104  42.0

In [44]:
df1.columns=[0,1] # 열 갯수 맞춰주기
df1+sr1.T

     0    1   2   3
0  196  174 NaN NaN
1  176  136 NaN NaN
2  198   88 NaN NaN
3  150  120 NaN NaN

In [46]:
sr1, sr1+df1.T

(0     98
 1     78
 2    100
 3     52
 Name: A, dtype: int64,
      0    1    2    3
 0  196  156  200  104
 1  194  136  110   94)